eseungho/OpenEPaperLink/ESP32_AP-Flasher/src/ble_filter.cpp
uint8_t swapBits(uint8_t num) {
    uint8_t result = 0;
    for (int i = 0; i < 8; ++i) {
        result |= ((num >> i) & 0x01) << (7 - i);
    }
    return result;
}

uint32_t compress_image(uint8_t address[8], uint8_t* buffer, uint32_t max_len) {
    uint32_t t = millis();
    PendingItem* queueItem = getQueueItem(address, 0);
    if (queueItem == nullptr) {
        prepareCancelPending(address);
        Serial.printf("blockrequest: couldn't find taginfo %02X%02X%02X%02X%02X%02X%02X%02X\r\n", address[7], address[6], address[5], address[4], address[3], address[2], address[1], address[0]);
        return 0;
    }
    if (queueItem->data == nullptr) {
        fs::File file = contentFS->open(queueItem->filename);
        if (!file) {
            Serial.print("No current file. " + String(queueItem->filename) + " Canceling request\r\n");
            prepareCancelPending(address);
            return 0;
        }
        queueItem->data = getDataForFile(file);
        Serial.println("Reading file " + String(queueItem->filename) + " in  " + String(millis() - t) + "ms");
        file.close();
    }

    uint16_t giciType = (address[7] << 8) | address[6];  // here we "extract" the display info again

    uint8_t screenResolution = (giciType >> 5) & 63;
    uint8_t dispPtype = (giciType >> 3) & 3;
    uint8_t availColors = ((giciType >> 1) & 3);
    uint8_t special_color = ((giciType >> 10) & 12);
    uint8_t singleDoubleMirror = giciType & 1;
    uint8_t canDoCompression = (giciType & 0x4000) ? 0 : 1;

    bool extra_color = false;
    bool extra_tft_bitshifting = false;
    bool mirror_width = false;
    uint16_t width_display = 104;
    uint16_t height_display = 212;

    switch (screenResolution) {
        case 0:
            width_display = 216;
            height_display = 104;
            break;
        case 1:
            width_display = 296;
            height_display = 128;
            break;
        case 2:
            width_display = 300;
            height_display = 400;
            break;
        case 3:
            width_display = 640;
            height_display = 384;
            break;
        case 4:
            width_display = 960;
            height_display = 640;
            break;
        case 5:
            width_display = 250;
            height_display = 136;
            break;
        case 6:
            width_display = 196;
            height_display = 96;
            break;
        case 7:
            width_display = 640;
            height_display = 480;
            break;
        case 8:
            width_display = 250;
            height_display = 128;
            break;
        case 9:
            width_display = 800;
            height_display = 480;
            break;
        case 10:
            width_display = 280;
            height_display = 480;
            break;
    }

    switch (dispPtype) {
        case 0:  // TFT
            mirror_width = false;
            extra_tft_bitshifting = true;  // Special case for the TFT Type
            break;
        case 1:  // EPA
            mirror_width = false;
            break;
        case 2:  // EPA1
            mirror_width = false;
            break;
        case 3:  // EPA2
            mirror_width = false;
            break;
    }

    if (giciType & 0x100)  // Some special case, needs to be tested if always correct
        mirror_width = true;

    bool fourcolor_packed = false;
    switch (availColors) {
        case 0:  // BW
            extra_color = false;
            break;
        case 1:  // BWR
            extra_color = true;
            break;
        case 2:  // BWY
            extra_color = true;
            break;
        case 3:  // BWRY — single bitplane, 2 bpp packed (GICisky four-color)
            extra_color = false;
            fourcolor_packed = true;
            break;
        case 4:  // BWRGBYO
            extra_color = true;
            break;
    }
    switch (singleDoubleMirror) {
        case 0:  // Single image
            break;
        case 1:  // 2 Images
            break;
    }

    uint32_t len_compressed = 0;
    if (canDoCompression)
        len_compressed = 4;
    uint32_t curr_input_posi = 0;
    uint32_t byte_per_line = (height_display / 8);
    if (height_display % 8 != 0)
        byte_per_line++;
    Mirrorbuffer = (uint8_t*)malloc(byte_per_line + 1);
    if (Mirrorbuffer == nullptr) {
        Serial.println("BLE Could not create Mirrorbuffer!");
        return 0;
    }
    Serial.printf("BLE Filter options:\r\n");
    Serial.printf("screenResolution %d\r\n", screenResolution);
    Serial.printf("dispPtype %d\r\n", dispPtype);
    Serial.printf("availColors %d\r\n", availColors);
    Serial.printf("special_color %d\r\n", special_color);
    Serial.printf("singleDoubleMirror %d\r\n", singleDoubleMirror);
    Serial.printf("canDoCompression %d\r\n", canDoCompression);
    Serial.printf("byte_per_line %d\r\n", byte_per_line);
    Serial.printf("width_display %d\r\n", width_display);
    Serial.printf("height_display %d\r\n", height_display);
    Serial.printf("mirror_width %d\r\n", mirror_width);
    Serial.printf("fourcolor_packed %d\r\n", (int)fourcolor_packed);
    if (fourcolor_packed) {
        // GICisky BWRY: single bitplane, 2 bpp packed MSB-first.
        // Source from makeimage.cpp is dual-plane: plane1 (B/W) in [0..plane_size),
        // plane2 (color) in [plane_size..2*plane_size). Mapping per pixel:
        //   white (p1=0,p2=0) -> 01, black (1,0) -> 00,
        //   red   (0,1)       -> 11, yellow (1,1) -> 10.
        // i.e. high_bit = plane2, low_bit = ~plane1.
        if (mirror_width) {
            Serial.println("BLE BWRY mirror_width path is untested for this model");
        }
        uint32_t plane_size = (uint32_t)width_display * byte_per_line;
        uint32_t bpl_packed = byte_per_line * 2;
        for (int col = 0; col < width_display; col++) {
            if (canDoCompression) {
                buffer[len_compressed++] = 0x75;
                buffer[len_compressed++] = bpl_packed + 7;
                buffer[len_compressed++] = bpl_packed;
                buffer[len_compressed++] = 0x00;
                buffer[len_compressed++] = 0x00;
                buffer[len_compressed++] = 0x00;
                buffer[len_compressed++] = 0x00;
            }
            for (int b = 0; b < byte_per_line; b++) {
                uint32_t off = (uint32_t)col * byte_per_line + b;
                uint8_t bw = (off < queueItem->len) ? queueItem->data[off] : 0;
                uint8_t clr = (off + plane_size < queueItem->len) ? queueItem->data[off + plane_size] : 0;
                for (int half = 0; half < 2; half++) {
                    uint8_t out = 0;
                    for (int bit = 0; bit < 4; bit++) {
                        int srcbit = 7 - (half * 4 + bit);
                        uint8_t p1 = (bw >> srcbit) & 1;
                        uint8_t p2 = (clr >> srcbit) & 1;
                        uint8_t hi = p2;
                        uint8_t lo = p1 ? 0 : 1;
                        out |= (hi << (7 - bit * 2)) | (lo << (6 - bit * 2));
                    }
                    buffer[len_compressed++] = out;
                }
            }
        }
    } else {
        for (int i = 0; i < width_display; i++) {
            if (canDoCompression) {
                buffer[len_compressed++] = 0x75;
                buffer[len_compressed++] = byte_per_line + 7;
                buffer[len_compressed++] = byte_per_line;
                buffer[len_compressed++] = 0x00;
                buffer[len_compressed++] = 0x00;
                buffer[len_compressed++] = 0x00;
                buffer[len_compressed++] = 0x00;
            }
            if (mirror_width) {
                for (int b = 0; b < byte_per_line; b++) {
                    Mirrorbuffer[b] = ~queueItem->data[curr_input_posi++];
                }
                for (int b = byte_per_line - 1; b >= 0; b--) {
                    buffer[len_compressed++] = swapBits(Mirrorbuffer[b]);
                }
            } else {
                for (int b = 0; b < byte_per_line; b++) {
                    buffer[len_compressed++] = ~queueItem->data[curr_input_posi++];
                }
            }
        }
        if (extra_color) {
            for (int i = 0; i < width_display; i++) {
                if (canDoCompression) {
                    buffer[len_compressed++] = 0x75;
                    buffer[len_compressed++] = byte_per_line + 7;
                    buffer[len_compressed++] = byte_per_line;
                    buffer[len_compressed++] = 0x00;
                    buffer[len_compressed++] = 0x00;
                    buffer[len_compressed++] = 0x00;
                    buffer[len_compressed++] = 0x00;
                }
                if (mirror_width) {
                    for (int b = 0; b < byte_per_line; b++) {
                        if (queueItem->len <= curr_input_posi)
                            Mirrorbuffer[b] = 0x00;  // Do not anything outside of the buffer!
                        else
                            Mirrorbuffer[b] = queueItem->data[curr_input_posi++];
                    }
                    for (int b = byte_per_line - 1; b >= 0; b--) {
                        buffer[len_compressed++] = swapBits(Mirrorbuffer[b]);
                    }
                } else {
                    for (int b = 0; b < byte_per_line; b++) {
                        if (queueItem->len <= curr_input_posi) {
                            buffer[len_compressed++] = 0x00;  // Do not anything outside of the buffer!
                        } else {
                            buffer[len_compressed++] = queueItem->data[curr_input_posi++];
                        }
                    }
                }
            }
        }
    }
    if (canDoCompression) {
        buffer[0] = len_compressed & 0xff;
        buffer[1] = (len_compressed >> 8) & 0xff;
        buffer[2] = (len_compressed >> 16) & 0xff;
        buffer[3] = (len_compressed >> 24) & 0xff;
    }
    free(Mirrorbuffer);
    return len_compressed;
}

// Pack the dual-bitplane source produced by makeimage into the Wolink/Zhsunyco
// tag RAM layout. Source planes are width*byte_per_line bytes each, column-major,
// 1 bit/pixel: plane1 (B/W) then plane2 (colour). Output is width*height/4 bytes.
//
// 2.13"/3.5" use the proven 2 bpp COLUMN-major layout (4 px/byte MSB-first,
// map 00=B 01=W 10=Y 11=R) and are left untouched below.
//
// 7.5" 800x480 was reverse-engineered on hardware (the manufacturer renders & packs
// server-side, so the app contains no packing reference). Confirmed: the panel reads
// 2 bpp ROW-major. Diagnosis history, all reproduced offline by
// miscellaneous/wolink_ble_protocol/wolink_harness.py:
//   2bpp column-major   -> "comb teeth"/90-deg + white stipple   (scan transposed)
//   1bpp dual-plane row -> readable but tiled 2x2, colours wrong (panel is 2bpp not 1bpp)
//   2bpp ROW-major      -> correct                                <-- default
// The WOLINK75_* toggles apply to the 7.5" ONLY. If the next flash is off by a single
// global transform, change ONE, rebuild, flash:
//   image mirrored left/right .... toggle WOLINK75_XFLIP
//   image upside down ............ toggle WOLINK75_YFLIP
//   red and yellow swapped ....... toggle WOLINK75_SWAP_RY
//   comb-teeth/tiling returns .... you changed ROW_MAJOR/DUAL_PLANE; revert it
// Returns the produced length, or 0 on failure.
#define WOLINK75_DUAL_PLANE        0  // 0 = 2bpp (confirmed); 1 = two 1bpp planes (diagnostic only)
#define WOLINK75_ROW_MAJOR         1  // 1 = row-major (confirmed for 800x480); 0 = column-major
#define WOLINK75_XFLIP             1  // mirror left/right (field photo showed an L-R mirror)
#define WOLINK75_YFLIP             0  // mirror top/bottom
#define WOLINK75_MSB_FIRST         1  // 1 = MSB-first within byte; 0 = LSB-first
#define WOLINK75_SWAP_RY           0  // swap red<->yellow (colour-plane interpretation)
// dual-plane-only knobs (effective when WOLINK75_DUAL_PLANE = 1):
#define WOLINK75_PLANE_COLOR_FIRST 0
#define WOLINK75_INVERT_BW         1
#define WOLINK75_INVERT_COLOR      0
uint32_t pack_wolink_image(uint8_t address[8], uint8_t* buffer, uint32_t max_len) {
    PendingItem* queueItem = getQueueItem(address, 0);
    if (queueItem == nullptr) {
        prepareCancelPending(address);
        Serial.printf("Wolink pack: missing taginfo %02X%02X%02X%02X%02X%02X\r\n",
                      address[5], address[4], address[3], address[2], address[1], address[0]);
        return 0;
    }
    if (queueItem->data == nullptr) {
        fs::File file = contentFS->open(queueItem->filename);
        if (!file) {
            Serial.print("Wolink pack: no file " + String(queueItem->filename) + ", canceling\r\n");
            prepareCancelPending(address);
            return 0;
        }
        queueItem->data = getDataForFile(file);
        file.close();
    }

