eseungho/OpenEPaperLink/ESP32_AP-Flasher/src/ble_filter.cpp
    tagRecord* taginfo = tagRecord::findByMAC(address);
    uint8_t hwType = (taginfo != nullptr) ? taginfo->hwType : 0;
    uint16_t width = 0, height = 0;
    switch (hwType) {
        case WOLINK_BLE_EPD_213_BWRY:
            width = 250;
            height = 128;
            break;
        case WOLINK_BLE_EPD_350_BWRY:
            width = 384;
            height = 184;
            break;
        case WOLINK_BLE_EPD_750_BWRY:
            width = 800;
            height = 480;
            break;
        default:
            Serial.printf("Wolink pack: unsupported hwType 0x%02X, canceling\r\n", hwType);
            prepareCancelPending(address);
            return 0;
    }
    const uint32_t byte_per_line = (uint32_t)height / 8;
    const uint32_t plane_size = (uint32_t)width * byte_per_line;
    const uint32_t out_len = (uint32_t)width * ((uint32_t)height / 4);

    if (out_len > max_len) {
        Serial.printf("Wolink pack: buffer too small (%u < %u)\r\n",
                      (unsigned)max_len, (unsigned)out_len);
        return 0;
    }
    if (queueItem->len < 2 * plane_size) {
        Serial.printf("Wolink pack: source too small (%u < %u)\r\n",
                      (unsigned)queueItem->len, (unsigned)(2 * plane_size));
        return 0;
    }

    memset(buffer, 0, out_len);

    if (hwType == WOLINK_BLE_EPD_750_BWRY) {
        // ---- 7.5" 800x480: configurable, defaults to confirmed 2 bpp ROW-major ----
#if WOLINK75_DUAL_PLANE
        // Diagnostic only: two 1bpp planes (B/W + colour), de-interleaved.
        Serial.printf("Wolink 7.5\" pack: DUAL-PLANE scan=%s order=%s invBW=%d invC=%d xflip=%d yflip=%d msb=%d\r\n",
                      WOLINK75_ROW_MAJOR ? "row" : "col", WOLINK75_PLANE_COLOR_FIRST ? "C,BW" : "BW,C",
                      WOLINK75_INVERT_BW, WOLINK75_INVERT_COLOR, WOLINK75_XFLIP, WOLINK75_YFLIP, WOLINK75_MSB_FIRST);
        const uint32_t out_plane = (uint32_t)width * (uint32_t)height / 8;  // one 1bpp plane
        uint8_t* bwPlane    = WOLINK75_PLANE_COLOR_FIRST ? (buffer + out_plane) : buffer;
        uint8_t* colorPlane = WOLINK75_PLANE_COLOR_FIRST ? buffer : (buffer + out_plane);
        for (int x = 0; x < width; x++) {
            int phy_x = WOLINK75_XFLIP ? (width - 1 - x) : x;
            for (int y = 0; y < height; y++) {
                uint32_t off = (uint32_t)x * byte_per_line + (y / 8);
                uint8_t mask = 0x80 >> (y % 8);
                uint8_t p1 = (queueItem->data[off] & mask) ? 1 : 0;
                uint8_t p2 = (queueItem->data[off + plane_size] & mask) ? 1 : 0;
                uint8_t bw    = WOLINK75_INVERT_BW    ? (p1 ? 0 : 1) : p1;
                uint8_t color = WOLINK75_INVERT_COLOR ? (p2 ? 0 : 1) : p2;
                int phy_y = WOLINK75_YFLIP ? (height - 1 - y) : y;
                uint32_t ob; uint8_t omask;
                if (WOLINK75_ROW_MAJOR) {
                    ob = (uint32_t)phy_y * ((uint32_t)width / 8) + (phy_x / 8);
                    omask = WOLINK75_MSB_FIRST ? (0x80 >> (phy_x % 8)) : (uint8_t)(1 << (phy_x % 8));
                } else {
                    ob = (uint32_t)phy_x * ((uint32_t)height / 8) + (phy_y / 8);
                    omask = WOLINK75_MSB_FIRST ? (0x80 >> (phy_y % 8)) : (uint8_t)(1 << (phy_y % 8));
                }
                if (bw)    bwPlane[ob]    |= omask;
                if (color) colorPlane[ob] |= omask;
            }
        }
#else
        // Confirmed format: 2 bpp, ROW-major, 4 px/byte, map 00=B 01=W 10=Y 11=R.
        Serial.printf("Wolink 7.5\" pack: 2BPP scan=%s xflip=%d yflip=%d msb=%d swapRY=%d\r\n",
                      WOLINK75_ROW_MAJOR ? "row" : "col", WOLINK75_XFLIP, WOLINK75_YFLIP,
                      WOLINK75_MSB_FIRST, WOLINK75_SWAP_RY);
        for (int x = 0; x < width; x++) {
            int phy_x = WOLINK75_XFLIP ? (width - 1 - x) : x;
            for (int y = 0; y < height; y++) {
                uint32_t off = (uint32_t)x * byte_per_line + (y / 8);
                uint8_t mask = 0x80 >> (y % 8);
                uint8_t p1 = (queueItem->data[off] & mask) ? 1 : 0;
                uint8_t p2 = (queueItem->data[off + plane_size] & mask) ? 1 : 0;
                if (WOLINK75_SWAP_RY && p2) p1 ^= 1;                 // red<->yellow
                uint8_t color = ((uint8_t)(p2 & 1) << 1) | (uint8_t)(p1 ? 0 : 1);
                int phy_y = WOLINK75_YFLIP ? (height - 1 - y) : y;
                uint32_t ob; int sh;
                if (WOLINK75_ROW_MAJOR) {
                    ob = (uint32_t)phy_y * ((uint32_t)width / 4) + (phy_x / 4);
                    sh = WOLINK75_MSB_FIRST ? (6 - (phy_x % 4) * 2) : ((phy_x % 4) * 2);
                } else {
                    ob = (uint32_t)phy_x * ((uint32_t)height / 4) + (phy_y / 4);
                    sh = WOLINK75_MSB_FIRST ? (6 - (phy_y % 4) * 2) : ((phy_y % 4) * 2);
                }
                buffer[ob] |= color << sh;
            }
        }
#endif
        return out_len;
    }

    // ---- 2.13"/3.5": proven 2 bpp column-major, both axes flipped (unchanged) ----
    for (int x = 0; x < width; x++) {
        int phy_x = (width - 1) - x;
        for (int y = 0; y < height; y++) {
            uint32_t off = (uint32_t)x * byte_per_line + (y / 8);
            uint8_t mask = 0x80 >> (y % 8);
            uint8_t p1 = (queueItem->data[off] & mask) ? 1 : 0;                 // B/W plane
            uint8_t p2 = (queueItem->data[off + plane_size] & mask) ? 1 : 0;    // color plane
            // black (1,0)->00, white (0,0)->01, red (0,1)->11, yellow (1,1)->10.
            uint8_t color = ((uint8_t)(p2 & 1) << 1) | (uint8_t)(p1 ? 0 : 1);
            int phy_y = (height - 1) - y;
            uint32_t out_byte = (uint32_t)phy_x * (height / 4) + (phy_y / 4);
            int out_shift = 6 - (phy_y % 4) * 2;
            buffer[out_byte] |= color << out_shift;
        }
    }
    return out_len;
}

uint32_t get_ATC_BLE_OEPL_image(uint8_t address[8], uint8_t* buffer, uint32_t max_len, uint8_t* dataType, uint8_t* dataTypeArgument, uint16_t* nextCheckIn) {
    uint32_t t = millis();
    PendingItem* queueItem = getQueueItem(address, 0);
    if (queueItem == nullptr) {
        prepareCancelPending(address);
        Serial.printf("blockrequest: couldn't find taginfo %02X%02X%02X%02X%02X%02X%02X%02X\r\n", address[7], address[6], address[5], address[4], address[3], address[2], address[1], address[0]);
        return 0;
    }
    if (queueItem->data == nullptr) {
        fs::File file = contentFS->open(queueItem->filename);
        if (!file) {
            Serial.print("No current file. " + String(queueItem->filename) + " Canceling request\r\n");
            prepareCancelPending(address);
            return 0;
        }
        queueItem->data = getDataForFile(file);
        Serial.println("Reading file " + String(queueItem->filename) + " in  " + String(millis() - t) + "ms");
        file.close();
    }
    if (queueItem->len > max_len) {
        Serial.print("The upload is too big better cencel it\r\n");
        prepareCancelPending(address);
        return 0;
    }
    *dataType = queueItem->pendingdata.availdatainfo.dataType;
    *dataTypeArgument = queueItem->pendingdata.availdatainfo.dataTypeArgument;
    *nextCheckIn = queueItem->pendingdata.availdatainfo.nextCheckIn;
    uint32_t len_compressed = queueItem->len;
    memcpy(buffer, queueItem->data, queueItem->len);
    Serial.print("Data is prepared Len: " + String(queueItem->len) + "\r\n");
    return queueItem->len;
}

#endif
